#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.shared.data.terraform_remote_state.infrastructure_state: Reading...
module.shared.data.terraform_remote_state.infrastructure_state: Read complete after 1s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.buckets.aws_s3_bucket_object.add_investment_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_investment_function_object" {
      ~ etag               = "23891e94660fc3974b07f94d8b7747ff" -> "7ff7b8525bfa5db42383a2f5a0155f80"
        id                 = "lambdas/demo/add_investment_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_scenario_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_scenario_function_object" {
      ~ etag               = "43fb6061602ac5b5bf382d2bdac236c9" -> "1a96cd913fc54a88b105c83f69ef0c2d"
        id                 = "lambdas/demo/add_scenario_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_tag_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_tag_function_object" {
      ~ etag               = "0dfa3997ea5e8752c9398461462dcdf1" -> "901e537553d4390254785fd2a8c962d7"
        id                 = "lambdas/demo/add_tag_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_user_to_customer_group_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_user_to_customer_group_function_object" {
      ~ etag               = "305e7b1d742df25ae3f99f67a3abeb99" -> "64db7d0ab0d6f300fbf7f650007fc28d"
        id                 = "lambdas/demo/add_user_to_customer_group_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.assign_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "assign_company_permissions_function_object" {
      ~ etag               = "d0806073b0462a98b405677f329955a7" -> "775dbaf445a10cd3089ffa34908a0be3"
        id                 = "lambdas/demo/assign_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.authorize_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "authorize_function_object" {
      ~ etag               = "b9c1f5196e8cf334925810dc8724f4cf" -> "c3caa8b1b816a073fb804b36b3693ad1"
        id                 = "lambdas/demo/authorize_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_company_publicly_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_company_publicly_function_object" {
      ~ etag               = "b22ec61bb24505fc5bf6ef732a475300" -> "8d997a8ee3fc9f7bb225ba1dfa0d0dbf"
        id                 = "lambdas/demo/change_company_publicly_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_user_role_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_user_role_function_object" {
      ~ etag               = "7133673da016ab2a6a4929c1f9bb877b" -> "e5610b0d13608e1438f9f9f363e22fab"
        id                 = "lambdas/demo/change_user_role_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.connect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "connect_function_object" {
      ~ etag               = "a58424c8ae6702290e51d84a93a43eee" -> "1e8e2b956624d4fa91153b35c5822c21"
        id                 = "lambdas/demo/connect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_company_function_object" {
      ~ etag               = "91a66ffa124d7be71b00ccb87ab21e74" -> "979587aac9569f5427e63856615abd33"
        id                 = "lambdas/demo/delete_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_scenarios_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_scenarios_function_object" {
      ~ etag               = "0be5a3d661c41e816abe2d2b29340233" -> "6bcc048176c215cf24fb2b752fd4bc5c"
        id                 = "lambdas/demo/delete_scenarios_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_tags_function_object" {
      ~ etag               = "3a54d2d7d691cccd2693db079f885f2d" -> "53747a10ab3f45a4c02dadf595f757a9"
        id                 = "lambdas/demo/delete_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.disconnect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "disconnect_function_object" {
      ~ etag               = "7935b6700026680154e43e318701c419" -> "c99bf992b863d94fa3b06debd0a1dcd1"
        id                 = "lambdas/demo/disconnect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.download_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "download_comparison_vs_peers_function_object" {
      ~ etag               = "28b74021c6cbe65b191856b38c20dcfb" -> "13bd8f74af8a64667c95371d750a8c29"
        id                 = "lambdas/demo/download_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "edit_modify_data_function_object" {
      ~ etag               = "b64238a5612250bc25cdad6103ae511a" -> "bc59f5f4cf4856ac84417c0e10b99ebb"
        id                 = "lambdas/demo/edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_companies_function_object" {
      ~ etag               = "8710c9e66b25cb266ded1a81b23d152c" -> "8e0747dae802dbe4bf6cb0e82af3312c"
        id                 = "lambdas/demo/get_all_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_public_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_public_companies_function_object" {
      ~ etag               = "b905af015ea7cc1051e06978a98f6446" -> "ed2f9adab8d6c151c8e9cbfb37195448"
        id                 = "lambdas/demo/get_all_public_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_ranges_function_object" {
      ~ etag               = "e4ee69051a1b4c488c138cc94a00f3a9" -> "a15fca53f9f9b9e4632767ebd189b6aa"
        id                 = "lambdas/demo/get_all_ranges_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_tags_function_object" {
      ~ etag               = "f221b659954cacdc84718ee3019cdb85" -> "9edf35e53be449d14c0e74df055b29b0"
        id                 = "lambdas/demo/get_all_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_by_metric_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_by_metric_report_function_object" {
      ~ etag               = "effbfec5527b18ed7a961d486e3fca85" -> "e1b966b78f06dcf0bc0e0e5001d0f077"
        id                 = "lambdas/demo/get_by_metric_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_details_function_object" {
      ~ etag               = "24f0c969d49d091945c0a2b04b93f481" -> "7d839f272d1864f801c74f0777e75967"
        id                 = "lambdas/demo/get_company_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_investments_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_investments_function_object" {
      ~ etag               = "6b70c0abf6b8ea57516d3786992cf6cc" -> "c65e029b4a58b578b3ac5af0256a3591"
        id                 = "lambdas/demo/get_company_investments_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_permissions_function_object" {
      ~ etag               = "5f4a43af5af4ac4de255db61567494ab" -> "037f07545ab1ca31482c1f0f789426b5"
        id                 = "lambdas/demo/get_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_report_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_report_vs_peers_function_object" {
      ~ etag               = "6eb61f385d307fb6d4e48cce303277cd" -> "2297de18a962573450adcc2cb12ad300"
        id                 = "lambdas/demo/get_company_report_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_comparison_vs_peers_function_object" {
      ~ etag               = "7b24218ebf4819658d81c82b5348df9f" -> "fc1e6a7bd0b5b9c2452961d636873993"
        id                 = "lambdas/demo/get_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_dynamic_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_dynamic_report_function_object" {
      ~ etag               = "1b6986a6f4fd199371fae24f6939d23f" -> "21bace01a7194cd2c5415d7a9cd0167e"
        id                 = "lambdas/demo/get_dynamic_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_edit_modify_data_function_object" {
      ~ etag               = "204e66eb2e3d5f157fa3cd3aab30c6b8" -> "b2f390328c7bfadb43483cd63b1a24e9"
        id                 = "lambdas/demo/get_edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_full_year_total_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_full_year_total_function_object" {
      ~ etag               = "5bc352e1d017449c8e0581beeffd06d9" -> "9f4030370c942fb184683f6de4ee1546"
        id                 = "lambdas/demo/get_full_year_total_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_investment_date_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_investment_date_report_function_object" {
      ~ etag               = "8161348dd5e902c3cdc363e11bd0238d" -> "3502ba71958b4b93922824480f6c363c"
        id                 = "lambdas/demo/get_investment_date_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_metric_types_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_metric_types_function_object" {
      ~ etag               = "f5f4acf605a3689984120a30c5a275c8" -> "e1565ec28bcc34f62d83edb3cbc9fad9"
        id                 = "lambdas/demo/get_metric_types_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_ranges_by_metric_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_ranges_by_metric_function_object" {
      ~ etag               = "403352386718d38d6268b98b6367ff10" -> "2f9709514bbf5bcc68ffc62cfc5f99ac"
        id                 = "lambdas/demo/get_ranges_by_metric_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_roles_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_roles_function_object" {
      ~ etag               = "ec8dbe1b467f3ef7ced9a3625ea42b6a" -> "68f83c59db4c7c06d1fbbf47410c5376"
        id                 = "lambdas/demo/get_roles_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_tags_by_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_tags_by_company_function_object" {
      ~ etag               = "6a31330cf85e2065b6eb62c75aa98b2e" -> "3f3c38434103dec417a5f9e5fde9f5c9"
        id                 = "lambdas/demo/get_tags_by_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_universe_overview_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_universe_overview_function_object" {
      ~ etag               = "96d910c50a2d2c36345deeab022a8d77" -> "92a4826a5eaf057b9120a1c34bd67e25"
        id                 = "lambdas/demo/get_universe_overview_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_user_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_user_details_function_object" {
      ~ etag               = "e976972942742b13df33325b2247d100" -> "893f433e07ec2817c7d33e2054b54f63"
        id                 = "lambdas/demo/get_user_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_users_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_users_function_object" {
      ~ etag               = "0feaa67a5af7c06a3152de853038f452" -> "a3489cc2b293c2d43fa557ca77bb90f6"
        id                 = "lambdas/demo/get_users_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.glue_trigger_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "glue_trigger_function_object" {
      ~ etag               = "516950428b7bd11be72fef2b19552b28" -> "ed429acdd286609b7722d1d32e9ecbb7"
        id                 = "lambdas/demo/glue_trigger_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.layer_libraries_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "layer_libraries_object" {
      ~ etag               = "8a435b92e470202cc094598e515873cf" -> "18d38e083563e057bf3ebbfe3f8ade69"
        id                 = "layer/demo/layer_libraries.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.message_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "message_function_object" {
      ~ etag               = "2d590580d393eedce5148961adedb66f" -> "e71f14fd490291c1e93dd2903cf4b944"
        id                 = "lambdas/demo/message.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.modify_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "modify_ranges_function_object" {
      ~ etag               = "f24f7f4c9b5c475984f5a82f221ac56f" -> "6957d8078c7e178e2b0a5d9e437bd454"
        id                 = "lambdas/demo/modify_ranges_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.register_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "register_function_object" {
      ~ etag               = "290b2167cff29246f39b67df075a452e" -> "9dbebe15bdd46c8389889d619d865108"
        id                 = "lambdas/demo/register.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_data_function_object" {
      ~ etag               = "790b888e9c1053cf5a16df0d0975f1a2" -> "66e56e2a4d397052865c7b510ed131a0"
        id                 = "lambdas/demo/update_data.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_tags_function_object" {
      ~ etag               = "a18eeb90574fb84689335a958d11d8bb" -> "8702f3d3f86e874f91e9139988cfa536"
        id                 = "lambdas/demo/update_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.upload_file_s3_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "upload_file_s3_function_object" {
      ~ etag               = "1fa997b45de13152d7c2f0d98b69bc1d" -> "91405f0ae71a8531a60e1dc30046cbb8"
        id                 = "lambdas/demo/upload_file_s3_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.validate_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "validate_data_function_object" {
      ~ etag               = "445164fc122817a5d771d25da36b2d69" -> "c6616b51e50fc64af59be8e5e208c87c"
        id                 = "lambdas/demo/validate_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.verify_users_with_same_email_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "verify_users_with_same_email_function_object" {
      ~ etag               = "2e1ebf3c85c2f512beb18a0e51f07382" -> "3cb2a7aad7b562f06e1222ca53421c29"
        id                 = "lambdas/demo/verify_users_with_same_email_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.functions.aws_lambda_function.add_investment_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_investment_lambda_function" {
        id                             = "demo_add_investment_lambda_function"
      ~ last_modified                  = "2023-01-25T15:00:43.000+0000" -> (known after apply)
      ~ source_code_hash               = "3GQsYvJpRNeg7AtO9Ii1s/ihvgrQt//PUekTKknP8rA=" -> "brs2cNOPej1DCOOPOMTSCfbdalrlniGcWbHO8gJDwF8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_scenario_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_scenario_lambda_function" {
        id                             = "demo_add_scenario_lambda_function"
      ~ last_modified                  = "2023-01-25T15:00:36.000+0000" -> (known after apply)
      ~ source_code_hash               = "gFmz9MN/dsbvVfz6P9Qpa2iLxOWPR1KjCGxfWNtb6u4=" -> "AmKt/vkBp+BZ1ibayAdgN55e3mYWNmvO39Q9ETmzMoY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_tag_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_tag_lambda_function" {
        id                             = "demo_add_tag_lambda_function"
      ~ last_modified                  = "2023-01-25T15:00:22.000+0000" -> (known after apply)
      ~ source_code_hash               = "3KYbZCEih2yu0ZpetyiI7wIfP/5aAnTaTadZrLr0EyY=" -> "JBDpC+3hLa89hhle7w6p+/S+Lk+IMrdUYQDi4jnvFTo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_user_to_customer_group_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_user_to_customer_group_lambda_function" {
        id                             = "demo_add_user_to_customer_group_lambda_function"
      ~ last_modified                  = "2023-01-25T15:01:02.000+0000" -> (known after apply)
      ~ source_code_hash               = "+5oJXvLY84g4LdPq75H7DmgkC5s/4JZp6ZTgBmutnaQ=" -> "cosZoFYrqPSajTep72PB5YkYoqaiT74NQBcrSix7+dg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.assign_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "assign_company_permissions_lambda_function" {
        id                             = "demo_assign_company_permissions_lambda_function"
      ~ last_modified                  = "2023-01-25T15:00:57.000+0000" -> (known after apply)
      ~ source_code_hash               = "2QNbKgSfqmSXaxsNnb7YdHrLf+J/NYdqjOvjRL/+JeI=" -> "9YKreRTQZxdwojLsUFpsVP/Oq0lGpXQnJVkMg0gC0Dc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.authorize_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "authorize_lambda_function" {
        id                             = "demo_authorize_lambda_function"
      ~ last_modified                  = "2023-01-25T15:00:45.000+0000" -> (known after apply)
      ~ source_code_hash               = "UV3CmkNpuxZlXD2EjACiKTwAUYiYE9jTrWcTkkBLmcs=" -> "YRxlw3Oy1TD1P12oWVbqtp6LmJsbiKvT7EmbXm+T6vw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_company_publicly_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_company_publicly_lambda_function" {
        id                             = "demo_change_company_publicly_lambda_function"
      ~ last_modified                  = "2023-01-25T15:00:45.000+0000" -> (known after apply)
      ~ source_code_hash               = "rArqnkkfnAgjhxLYD8xOAE0VZ2rqxVo8VIHQoowstmE=" -> "vtsV22dUM+5SM9LntTOggCt0xs3CGvKbOTztBSsn2jk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_user_role_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_user_role_lambda_function" {
        id                             = "demo_change_user_role_lambda_function"
      ~ last_modified                  = "2023-01-25T15:00:49.000+0000" -> (known after apply)
      ~ source_code_hash               = "VMjPnCflgtaiq6g9pq5YYo08HYltYP3NaBSnVPFDpRU=" -> "4+DLQk0XnIgoNJgeNKNST/7r5tXya9QrufKX/Zx2yS0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.connect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "connect_lambda_function" {
        id                             = "demo_connect_lambda_function"
      ~ last_modified                  = "2023-01-25T15:00:18.000+0000" -> (known after apply)
      ~ source_code_hash               = "0vZYbRvMGY/pVekA9ZOllfNShPOw+KidZITezW9gv4g=" -> "uow59o2eU7HA0cEfnQ7/KNRMqAPWFS+y93Ch9YDy5og="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.functions.aws_lambda_function.delete_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_company_lambda_function" {
        id                             = "demo_delete_company_lambda_function"
      ~ last_modified                  = "2023-01-25T15:00:31.000+0000" -> (known after apply)
      ~ source_code_hash               = "74n+KPrdp7se2ZJEzE5o3ChFsWSomxq3jSrGXrT8D7M=" -> "sHQCZE2ziqcvqFv4eYZqqT522CjbFId0DShdN/rK06o="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_scenarios_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_scenarios_lambda_function" {
        id                             = "demo_delete_scenarios_lambda_function"
      ~ last_modified                  = "2023-01-25T15:00:23.000+0000" -> (known after apply)
      ~ source_code_hash               = "iGmGlZ+TFHQ2ViA2RCP4kiwd3Wwx+EhqoLi46Pgmm9o=" -> "FhxJgagjSEnWKJ2s9fA3JihP0YzcGM5m0fl51Fp1CqQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_tags_lambda_function" {
        id                             = "demo_delete_tags_lambda_function"
      ~ last_modified                  = "2023-01-25T15:00:57.000+0000" -> (known after apply)
      ~ source_code_hash               = "YOQxWwF0CmeU4dzsIiBRMmpbsNyFivF49Px+ACSvKfM=" -> "85dlA3rBrXGB66rJIcMkt6VL21AGbOjB9Oh8xoHhwe4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.disconnect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "disconnect_lambda_function" {
        id                             = "demo_disconnect_lambda_function"
      ~ last_modified                  = "2023-01-25T15:00:43.000+0000" -> (known after apply)
      ~ source_code_hash               = "NEGHwZwk2XQeHfMykZ1BRPrXuYFYCXIBN1z3Z2PYq2U=" -> "C/HwyNZC7RHLAqIRN98PgRzX1wajwkUxt0LqZU0gEm0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.download_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "download_comparison_vs_peers_lambda_function" {
        id                             = "demo_download_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2023-01-25T15:00:43.000+0000" -> (known after apply)
      ~ source_code_hash               = "lWAhiWXKUbyVF19vrsHtQSmMVvrIQF4YxPFvmp8e48k=" -> "F96cp63rErax9JUP4tqVtpbu7nKCQYWutHUB6csDj/s="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "edit_modify_data_lambda_function" {
        id                             = "demo_edit_modify_data_lambda_function"
      ~ last_modified                  = "2023-01-25T15:00:49.000+0000" -> (known after apply)
      ~ source_code_hash               = "2psBkOGN4dfUJIFg31C5Cp3kSCT/I577TxkD4x9TmjE=" -> "qStbFwqzDUea5A9M4GJdHTCTJQHG77G0qA/Qf/4FAto="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_companies_lambda_function" {
        id                             = "demo_get_all_companies_lambda_function"
      ~ last_modified                  = "2023-01-25T15:00:55.000+0000" -> (known after apply)
      ~ source_code_hash               = "xPWf9wyg5s+OSTX1PWvYLBhihVhjGhcviUA5xQL3BEw=" -> "uF27oo01M7XYSUtZzQerjBo+Wu6OK6HybcGBa2bgfKo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_public_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_public_companies_lambda_function" {
        id                             = "demo_get_all_public_companies_lambda_function"
      ~ last_modified                  = "2023-01-25T15:01:01.000+0000" -> (known after apply)
      ~ source_code_hash               = "BHHEpJE8koE9LIP4WfxUCIQkdbA7Kk1Uy8mo5YPLORQ=" -> "bf5el5BFuqQ3rTU+4a/AAY5qocOWOPbwcy0mKaICjTw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_ranges_lambda_function" {
        id                             = "demo_get_all_ranges_lambda_function"
      ~ last_modified                  = "2023-01-25T15:00:43.000+0000" -> (known after apply)
      ~ source_code_hash               = "HdL7uw5gUIgZ4gYjEEvd1ryeH4/qR+jc1glccPSzF/w=" -> "D5QxM6dAq51/FHOl0AjlY/GkToLmxNO5NZmyiyuRPYk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_tags_lambda_function" {
        id                             = "demo_get_all_tags_lambda_function"
      ~ last_modified                  = "2023-01-25T15:00:52.000+0000" -> (known after apply)
      ~ source_code_hash               = "8AjloweViuAKUB06jaKAy3NcWqKO/PTOCJQ56+vopQE=" -> "tLC9saeheTF/j7ae/ahBfNOQzPL7Br3k+q0gJvn0XIU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_by_metric_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_by_metric_report_lambda_function" {
        id                             = "demo_get_by_metric_report_lambda_function"
      ~ last_modified                  = "2023-01-25T15:01:06.000+0000" -> (known after apply)
      ~ source_code_hash               = "A2SuiZXnPt5BNzxPDuvOD9mZ9Cg/AzDXvFAZ3PDjwxk=" -> "086f0LYwa8HEx04GAa0Y8TmK7Ve3y35KjLg1nAuMK3s="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_details_lambda_function" {
        id                             = "demo_get_company_details_lambda_function"
      ~ last_modified                  = "2023-01-25T15:00:52.000+0000" -> (known after apply)
      ~ source_code_hash               = "wz5QSrrfK6QThFBrlJBhhe0gObU2/pUCiUXLp+1T0hs=" -> "cB6dGQh5NBkZeoJ2RKRi01Z+xhn4jahkyJNCkaaxu0g="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_investments_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_investments_lambda_function" {
        id                             = "demo_get_company_investments_lambda_function"
      ~ last_modified                  = "2023-01-25T15:00:48.000+0000" -> (known after apply)
      ~ source_code_hash               = "LkWLP3J+2+qZZLSHqgOMWAVT3oU4tOZIu1e8HZWk/Ns=" -> "cv2DLb/8hhW/0AAp1zWgPRAkRlEZUJ8zKDgTM6m7oK0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_permissions_lambda_function" {
        id                             = "demo_get_company_permissions_lambda_function"
      ~ last_modified                  = "2023-01-25T15:00:24.000+0000" -> (known after apply)
      ~ source_code_hash               = "o97Yo2jNHWbhSS24scK/YksaEBiSRyqa9gFmB3Ei+Tw=" -> "/AdGjafcjuBCwF9Ubo8JA8zAjBfe43Ekiwlt3lndlmU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_report_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_report_vs_peers_lambda_function" {
        id                             = "demo_get_company_report_vs_peers_lambda_function"
      ~ last_modified                  = "2023-01-25T15:00:36.000+0000" -> (known after apply)
      ~ source_code_hash               = "AAKaCozxH6K8lIohjgaKaVlZg4UIQNxvJnAivMKMMkk=" -> "JXO06Z1UQ57Hw8S+V2ARPWswb9xZnhcRyjImAkUqU1M="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_comparison_vs_peers_lambda_function" {
        id                             = "demo_get_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2023-01-25T15:00:21.000+0000" -> (known after apply)
      ~ source_code_hash               = "JOmyEiiML6XP/JSIip7+SSiqlquNQnB+ARx9MpN1dNw=" -> "X2IC7UoODWiNOxshGSc/KRMxQoUfs+eGZnHrvfEFQig="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_dynamic_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_dynamic_report_lambda_function" {
        id                             = "demo_get_dynamic_report_lambda_function"
      ~ last_modified                  = "2023-01-25T20:19:23.000+0000" -> (known after apply)
      ~ source_code_hash               = "J4gcs/OZlFORH0ZIEPAcRZxcFsSC90ui91mElH7jZ64=" -> "ruKizaRZ6zalz/RqANquXoPhHOyCAtnXk6JNoYSFpHQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_edit_modify_data_lambda_function" {
        id                             = "demo_get_edit_modify_data_lambda_function"
      ~ last_modified                  = "2023-01-25T15:00:56.000+0000" -> (known after apply)
      ~ source_code_hash               = "V27jRf4FkLJKfZqw/qV6wg3UtPsWf4xgD9qVGrWsDOg=" -> "nOTIlerbTnXjPKxP1voO71NHwZ051TxjJeR3tcVojxM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_full_year_total_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_full_year_total_lambda_function" {
        id                             = "demo_get_full_year_total_lambda_function"
      ~ last_modified                  = "2023-01-25T15:00:31.000+0000" -> (known after apply)
      ~ source_code_hash               = "PTJwcroAKpiiZb6Kff/0i5UTkhslApxdk+81jWgV7xA=" -> "5SE8wDYe+Z5Y538qUv9kB9OFs1F8OCkRKkXKnEkMAY4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_investment_date_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_investment_date_report_lambda_function" {
        id                             = "demo_get_investment_date_report_lambda_function"
      ~ last_modified                  = "2023-01-25T15:00:31.000+0000" -> (known after apply)
      ~ source_code_hash               = "7fP96KvBQVvLsFl4OeaH4jYmriyUGaAgnYUv5mrOO6E=" -> "3/55+rVqEdU7htLmGW7c9DGnEJWXTWFRjyrMpD+yCVg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_metric_types_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_metric_types_lambda_function" {
        id                             = "demo_get_metric_types_lambda_function"
      ~ last_modified                  = "2023-01-25T15:00:22.000+0000" -> (known after apply)
      ~ source_code_hash               = "rQ6ezOcQC7owLQlY0yVKUxadPusLLvpoeiIB0fplLVQ=" -> "YYp+JNKLQtQ25PlR+aDPbqCgnb3PgNDlh4jBHheFABc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_ranges_by_metric_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_ranges_by_metric_lambda_function" {
        id                             = "demo_get_ranges_by_metric_lambda_function"
      ~ last_modified                  = "2023-01-25T15:01:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "zuHB78H7DnfwJOL4ITHkAgrunypCw+8b7PLRRVo+raM=" -> "eI7xKv/ESqb8hylr2NgILUw8DEQHjnAqFbFoGkLM4FQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_roles_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_roles_lambda_function" {
        id                             = "demo_get_roles_lambda_function"
      ~ last_modified                  = "2023-01-25T15:00:37.000+0000" -> (known after apply)
      ~ source_code_hash               = "EbC7pQcIfF0qd6PPW5/9ztcArU3lmpxZMhT7eetINk4=" -> "e4MYtBsHS85cKYE4SvE2EofbX1b5vKBlha8ZTe5ij6Q="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_tags_by_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_tags_by_company_lambda_function" {
        id                             = "demo_get_tags_by_company_lambda_function"
      ~ last_modified                  = "2023-01-25T15:01:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "pC6I3CMItfEGMp7CSzK46sGFSYHRsOr9P9wmySSWkE8=" -> "0XuNIOBOnfS3MWGQkRORayq6vZmbjIpxNRKGY3fJxaM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_universe_overview_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_universe_overview_lambda_function" {
        id                             = "demo_get_universe_overview_lambda_function"
      ~ last_modified                  = "2023-01-25T15:00:36.000+0000" -> (known after apply)
      ~ source_code_hash               = "6AXGtSvWAptbt5rowppAzUc+Id92Hh9vnKUExMC4dLY=" -> "4mF/wDplvXD3fN848QRQ/r+/TVqiwFs1H1oWJN3F7H8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_user_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_user_details_lambda_function" {
        id                             = "demo_get_user_details_lambda_function"
      ~ last_modified                  = "2023-01-25T15:00:53.000+0000" -> (known after apply)
      ~ source_code_hash               = "mxQQR7miCrqEz8xlgzqfIO7cwTLcRddw/hfgAinu5gI=" -> "eOKjgxRScn670X97SzgsIHgv5X6lrGHLjvbRFBU/8Y0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_users_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_users_lambda_function" {
        id                             = "demo_get_users_lambda_function"
      ~ last_modified                  = "2023-01-25T15:00:31.000+0000" -> (known after apply)
      ~ source_code_hash               = "/92frkvR6tAIKDRruX4c/IhCa6In7w+P9aW00KU/gqI=" -> "ByXOQxsm+yp0jkfi7DUkuzX4jvo5xF5cLpWDzm9bWIY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.glue_trigger_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "glue_trigger_lambda_function" {
        id                             = "demo_glue_trigger_lambda_function"
      ~ last_modified                  = "2023-01-25T15:00:29.000+0000" -> (known after apply)
      ~ source_code_hash               = "TnKjDiwxi3RCMcpJi+keCCpNSjd6FZqu7LyBA8PDWXI=" -> "EB7lfMJ4VnbjUZ6l+HLRhQNFNFORQKkgGjsFXVF9Ork="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.message_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "message_lambda_function" {
        id                             = "demo_message_lambda_function"
      ~ last_modified                  = "2023-01-25T15:00:23.000+0000" -> (known after apply)
      ~ source_code_hash               = "vj1AUsuYCwixuTeJB7bTg6lhZbCcmlxh9fqJhn51HJc=" -> "Tm9n85TlGrsYm7l1UJaXQkGwoVokxTNenisnqk6wCJI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.modify_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "modify_ranges_lambda_function" {
        id                             = "demo_modify_ranges_lambda_function"
      ~ last_modified                  = "2023-01-25T15:00:54.000+0000" -> (known after apply)
      ~ source_code_hash               = "NfaSn8PxRvmT66wakBnpAwq4PzchM6VsscArROGSu10=" -> "QknezKAZuXMi9baIHG5xUHmK00Tqo63cEUkp111E2Z8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.register_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "register_lambda_function" {
        id                             = "demo_register_lambda_function"
      ~ last_modified                  = "2023-01-25T15:00:22.000+0000" -> (known after apply)
      ~ source_code_hash               = "jQXXKhAyYg2Hk1y6A/mJONr3+ffFuUjXVrJ3YOPnG2o=" -> "OKfUBDxi1LHTelVMSVWZnr5apSP7KUWr/UtzIcyfqLU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_data_lambda_function" {
        id                             = "demo_update_data_lambda_function"
      ~ last_modified                  = "2023-01-25T15:00:31.000+0000" -> (known after apply)
      ~ source_code_hash               = "QpQp1L2BG5wKG9OXGP2V4Odw+2m1JF0w793YQEqq+vY=" -> "ndcdrLe1XskDljUfzUx4XO2c53SncEz6h+UIsyi6Ng8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_tags_lambda_function" {
        id                             = "demo_update_tags_lambda_function"
      ~ last_modified                  = "2023-01-25T15:00:43.000+0000" -> (known after apply)
      ~ source_code_hash               = "Go2tFYt/NPu6npblUHdc5YSPc9Yau3iLLO1ALvwDW/8=" -> "8eqkfgVagK+EoStr3udBYFFv8vwO7NDzIXxuLLdf3y0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.upload_file_s3_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "upload_file_s3_lambda_function" {
        id                             = "demo_upload_file_s3_lambda_function"
      ~ last_modified                  = "2023-01-25T15:01:01.000+0000" -> (known after apply)
      ~ source_code_hash               = "XjZHOIoCyba0nGt4U+AdDaaDu9ppctoDxko07nM05co=" -> "KbCzaWCFni2aLJlETQoFgkVHGBaSoz8J6JrTPEEtrAI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.validate_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "validate_data_lambda_function" {
        id                             = "demo_validate_data_lambda_function"
      ~ last_modified                  = "2023-01-25T15:00:23.000+0000" -> (known after apply)
      ~ source_code_hash               = "3unJ4fhnzODmQH7hBcAb0dfxo2hUqNMHy9+N8OBTTwM=" -> "yRM9y/GzenpTJ6FNyUlnk3qZPdUJmxxv8B+O2wlmrdw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.verify_users_with_same_email_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "verify_users_with_same_email_lambda_function" {
        id                             = "demo_verify_users_with_same_email_lambda_function"
      ~ last_modified                  = "2023-01-25T15:00:21.000+0000" -> (known after apply)
      ~ source_code_hash               = "aHK7b41HwYyo3NZMCt0gRJ/27GSoPxeJbXrq8IwONTw=" -> "f2YUs+nH9Sl8hXvdRUuU0Ee2/sKuU9y83/3HOQj+vRA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.gateway_deployment.aws_api_gateway_deployment.gateway_deployment must be replaced
+/- resource "aws_api_gateway_deployment" "gateway_deployment" {
      ~ created_date      = "2023-01-25T15:00:18Z" -> (known after apply)
      ~ execution_arn     = "arn:aws:execute-api:us-west-2:435552912911:kb7gblbu69/demo" -> (known after apply)
      ~ id                = "z5xiui" -> (known after apply)
      ~ invoke_url        = "https://kb7gblbu69.execute-api.us-west-2.amazonaws.com/demo" -> (known after apply)
      ~ stage_description = "Deployed at 2023-01-25T15:00:17Z" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_deployment.deploy will be updated in-place
  ~ resource "aws_apigatewayv2_deployment" "deploy" {
      ~ description   = "Deployed at 2023-01-25T15:00:16Z" -> (known after apply)
        id            = "ey3sgf"
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_stage.stage will be updated in-place
  ~ resource "aws_apigatewayv2_stage" "stage" {
        id              = "demo"
        name            = "demo"
        tags            = {}
        # (8 unchanged attributes hidden)

      - access_log_settings {
          - destination_arn = "arn:aws:logs:us-west-2:435552912911:log-group:testing_websocket_api" -> null
          - format          = jsonencode(
                {
                  - caller       = "$context.identity.caller"
                  - connectionId = "$context.connectionId"
                  - eventType    = "$context.eventType"
                  - ip           = "$context.identity.sourceIp"
                  - requestId    = "$context.requestId"
                  - requestTime  = "$context.requestTime"
                  - routeKey     = "$context.routeKey"
                  - status       = "$context.status"
                  - user         = "$context.identity.user"
                }
            ) -> null
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 93 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didnt use the -out option to save this plan, so Terraform cant
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @FreddyJR1995, Action: `pull_request`*